from script_1 import get_lenght, math   
'''Перший варіант імпорту функцій. Використовується тоді, коли в файлі багато 
функцій, але ВСІ нам не потрібні. Такий метод використовує менше ресурсів пам'яті.

Виклик функції по першому варіанту імпорту виглядає так...
'''

get_lenght(70)


import script_1
from script_1 import * 

#імпорт всіх функцій. Так робити не рекомендується: є різні змінні (локальні, глобальні)
#імпорт всього ускладнить пошук помилок.

'''Це імпорт модулю (всього файлу)

В цьому разі виклик функції відбувається іншим шляхом...
'''

script_1.get_lenght(70)
print(math.pi)

# ВАЖЛИВО функція що імпортується може робити розрахунки в основному файлі. 
# Тому важливо щоб вона мала формат if __name__ == '__main__'
# В цьому разі функція не виведе результам розрухунку в основному файлі
 
  
# в разі імпорту модуля (файлу) можемо імпортувати з нього інші модулі,
# які були в нього імпортовані. Наприклад, модуль math
'''from script_1 import get_lenght, math'''


# імпортуючи функцію її можна перейменовувати  
from script_1 import get_lenght as get_lenght_by_diameter 

get_lenght_by_diameter(180)

